app/controllers/users_controller.rb

	def index
		@title = "All users"
		@users = User.paginate(:page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM "users"

	def show
		@user 		=	User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1

  	def create
  		@user = User.new(params[:user])
  		if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES ('2011-05-20 22:45:22.642472', 'hfds@example.org', '859e5f4c282afad54ced3d254c18090a528a6918702a65549366e9dc97346124', 'Holland Smith', '51e1fd06918b21131b07f3a23a94eadb752ecb309755eddf8de97271b20b5583', '2011-05-20 22:45:22.642472')

	def destroy
		#add code here to make sure admin can't destroy himself, pg. 409
		if User.find(params[:id]) == current_user
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

	def update
		@user = User.find(params[:id])    #<-- should be able to get rid of this with our new before-filter
		if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 6) LIMIT 1
UPDATE "users" SET "email" = 'object@object.com', "name" = 'Object Object', "updated_at" = '2011-05-21 20:29:14.417193' WHERE ("users"."id" = 6)